Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1292NCZAD.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOB_AHB</name>
      <prependToName>GPIOB_AHB</prependToName>
      <baseAddress>0x40059000</baseAddress>
      <interrupt><name>GPIOB</name><value>1</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOC_AHB</name>
      <prependToName>GPIOC_AHB</prependToName>
      <baseAddress>0x4005A000</baseAddress>
      <interrupt><name>GPIOC</name><value>2</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOD_AHB</name>
      <prependToName>GPIOD_AHB</prependToName>
      <baseAddress>0x4005B000</baseAddress>
      <interrupt><name>GPIOD</name><value>3</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOE_AHB</name>
      <prependToName>GPIOE_AHB</prependToName>
      <baseAddress>0x4005C000</baseAddress>
      <interrupt><name>GPIOE</name><value>4</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOF_AHB</name>
      <prependToName>GPIOF_AHB</prependToName>
      <baseAddress>0x4005D000</baseAddress>
      <interrupt><name>GPIOF</name><value>30</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOG_AHB</name>
      <prependToName>GPIOG_AHB</prependToName>
      <baseAddress>0x4005E000</baseAddress>
      <interrupt><name>GPIOG</name><value>31</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOH_AHB</name>
      <prependToName>GPIOH_AHB</prependToName>
      <baseAddress>0x4005F000</baseAddress>
      <interrupt><name>GPIOH</name><value>32</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOJ_AHB</name>
      <prependToName>GPIOJ_AHB</prependToName>
      <baseAddress>0x40060000</baseAddress>
      <interrupt><name>GPIOJ</name><value>51</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOK</name>
      <prependToName>GPIOK</prependToName>
      <baseAddress>0x40061000</baseAddress>
      <interrupt><name>GPIOK</name><value>52</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOL</name>
      <prependToName>GPIOL</prependToName>
      <baseAddress>0x40062000</baseAddress>
      <interrupt><name>GPIOL</name><value>53</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOM</name>
      <prependToName>GPIOM</prependToName>
      <baseAddress>0x40063000</baseAddress>
      <interrupt><name>GPIOM</name><value>72</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPION</name>
      <prependToName>GPION</prependToName>
      <baseAddress>0x40064000</baseAddress>
      <interrupt><name>GPION</name><value>73</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOP</name>
      <prependToName>GPIOP</prependToName>
      <baseAddress>0x40065000</baseAddress>
      <interrupt><name>GPIOP0</name><value>76</value></interrupt>
      <interrupt><name>GPIOP1</name><value>77</value></interrupt>
      <interrupt><name>GPIOP2</name><value>78</value></interrupt>
      <interrupt><name>GPIOP3</name><value>79</value></interrupt>
      <interrupt><name>GPIOP4</name><value>80</value></interrupt>
      <interrupt><name>GPIOP5</name><value>81</value></interrupt>
      <interrupt><name>GPIOP6</name><value>82</value></interrupt>
      <interrupt><name>GPIOP7</name><value>83</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOQ</name>
      <prependToName>GPIOQ</prependToName>
      <baseAddress>0x40066000</baseAddress>
      <interrupt><name>GPIOQ0</name><value>84</value></interrupt>
      <interrupt><name>GPIOQ1</name><value>85</value></interrupt>
      <interrupt><name>GPIOQ2</name><value>86</value></interrupt>
      <interrupt><name>GPIOQ3</name><value>87</value></interrupt>
      <interrupt><name>GPIOQ4</name><value>88</value></interrupt>
      <interrupt><name>GPIOQ5</name><value>89</value></interrupt>
      <interrupt><name>GPIOQ6</name><value>90</value></interrupt>
      <interrupt><name>GPIOQ7</name><value>91</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOR</name>
      <prependToName>GPIOR</prependToName>
      <baseAddress>0x40067000</baseAddress>
      <interrupt><name>GPIOR</name><value>92</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOS</name>
      <prependToName>GPIOS</prependToName>
      <baseAddress>0x40068000</baseAddress>
      <interrupt><name>GPIOS</name><value>93</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOA_AHB">
      <name>GPIOT</name>
      <prependToName>GPIOT</prependToName>
      <baseAddress>0x40069000</baseAddress>
      <interrupt><name>GPIOT</name><value>111</value></interrupt>
    </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>Register map for EEPROM peripheral</description>
      <groupName>EEPROM</groupName>
      <prependToName>EEPROM</prependToName>
      <baseAddress>0x400AF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EESIZE</name>
          <description>EEPROM Size Information</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EESIZE_WORDCNT</name>
              <description>Number of 32-Bit Words</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EEPROM_EESIZE_BLKCNT</name>
              <description>Number of 16-Word Blocks</description>
              <bitRange>[26:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEBLOCK</name>
          <description>EEPROM Current Block</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEBLOCK_BLOCK</name>
              <description>Current Block</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEOFFSET</name>
          <description>EEPROM Current Offset</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEOFFSET_OFFSET</name>
              <description>Current Address Offset</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EERDWR</name>
          <description>EEPROM Read-Write</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EERDWR_VALUE</name>
              <description>EEPROM Read or Write Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EERDWRINC</name>
          <description>EEPROM Read-Write with Increment</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EERDWRINC_VALUE</name>
              <description>EEPROM Read or Write Data with Increment</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDONE</name>
          <description>EEPROM Done Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEDONE_WORKING</name>
              <description>EEPROM Working</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EEPROM_EEDONE_WKERASE</name>
              <description>Working on an Erase</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EEPROM_EEDONE_WKCOPY</name>
              <description>Working on a Copy</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EEPROM_EEDONE_NOPERM</name>
              <description>Write Without Permission</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EEPROM_EEDONE_WRBUSY</name>
              <description>Write Busy</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EESUPP</name>
          <description>EEPROM Support Control and Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EESUPP_ERETRY</name>
              <description>Erase Must Be Retried</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EEPROM_EESUPP_PRETRY</name>
              <description>Programming Must Be Retried</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEUNLOCK</name>
          <description>EEPROM Unlock</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEUNLOCK_UNLOCK</name>
              <description>EEPROM Unlock</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROT</name>
          <description>EEPROM Protection</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEPROT_PROT</name>
              <description>Protection Control</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEPROM_EEPROT_PROT_RWNPW</name>
                  <description>This setting is the default. If there is no password, the block is not protected and is readable and writable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_EEPROT_PROT_RWPW</name>
                  <description>If there is a password, the block is readable or writable only when unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_EEPROT_PROT_RONPW</name>
                  <description>If there is no password, the block is readable, not writable</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EEPROM_EEPROT_ACC</name>
              <description>Access Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPASS0</name>
          <description>EEPROM Password</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEPASS0_PASS</name>
              <description>Password</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPASS1</name>
          <description>EEPROM Password</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEPASS1_PASS</name>
              <description>Password</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPASS2</name>
          <description>EEPROM Password</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEPASS2_PASS</name>
              <description>Password</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEINT</name>
          <description>EEPROM Interrupt</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEINT_INT</name>
              <description>Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEHIDE0</name>
          <description>EEPROM Block Hide 0</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEHIDE0_HN</name>
              <description>Hide Block</description>
              <bitRange>[31:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEHIDE1</name>
          <description>EEPROM Block Hide 1</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEHIDE1_HN</name>
              <description>Hide Block</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEHIDE2</name>
          <description>EEPROM Block Hide 2</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEHIDE2_HN</name>
              <description>Hide Block</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDBGME</name>
          <description>EEPROM Debug Mass Erase</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>EEPROM_EEDBGME_ME</name>
              <description>Mass Erase</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EEPROM_EEDBGME_KEY</name>
              <description>Erase Key</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>EEPROM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>EEPROM_PP_SIZE</name>
              <description>EEPROM Size</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_64</name>
                  <description>64 bytes of EEPROM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_128</name>
                  <description>128 bytes of EEPROM</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_256</name>
                  <description>256 bytes of EEPROM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_512</name>
                  <description>512 bytes of EEPROM</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_1K</name>
                  <description>1 KB of EEPROM</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_2K</name>
                  <description>2 KB of EEPROM</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_3K</name>
                  <description>3 KB of EEPROM</description>
                  <value>0x3f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_4K</name>
                  <description>4 KB of EEPROM</description>
                  <value>0x7f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_5K</name>
                  <description>5 KB of EEPROM</description>
                  <value>0xff</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPROM_PP_SIZE_6K</name>
                  <description>6 KB of EEPROM</description>
                  <value>0x1ff</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
