Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1292NCZAD.svd
        <register>
          <name>TXCNTMCOL</name>
          <description>Ethernet MAC Transmit Frame Count for Frames Transmitted after Multiple Collisions</description>
          <addressOffset>0x00000150</addressOffset>
          <fields>
            <field>
              <name>EMAC_TXCNTMCOL_TXMULTCOLG</name>
              <description>This field indicates the number of successfully transmitted frames after multiple collisions in the half-duplex mode</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXOCTCNTG</name>
          <description>Ethernet MAC Transmit Octet Count Good</description>
          <addressOffset>0x00000164</addressOffset>
          <fields>
            <field>
              <name>EMAC_TXOCTCNTG_TXOCTG</name>
              <description>This field indicates the number of bytes transmitted, exclusive of preamble, in good frames</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTGB</name>
          <description>Ethernet MAC Receive Frame Count for Good and Bad Frames</description>
          <addressOffset>0x00000180</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXCNTGB_RXFRMGB</name>
              <description>This field indicates the number of received good and bad frames</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTCRCERR</name>
          <description>Ethernet MAC Receive Frame Count for CRC Error Frames</description>
          <addressOffset>0x00000194</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXCNTCRCERR_RXCRCERR</name>
              <description>This field indicates the number of frames received with CRC error</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTALGNERR</name>
          <description>Ethernet MAC Receive Frame Count for Alignment Error Frames</description>
          <addressOffset>0x00000198</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXCNTALGNERR_RXALGNERR</name>
              <description>This field indicates the number of frames received with alignment (dribble) error</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTGUNI</name>
          <description>Ethernet MAC Receive Frame Count for Good Unicast Frames</description>
          <addressOffset>0x000001C4</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXCNTGUNI_RXUCASTG</name>
              <description>This field indicates the number of received good unicast frames</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VLNINCREP</name>
          <description>Ethernet MAC VLAN Tag Inclusion or Replacement</description>
          <addressOffset>0x00000584</addressOffset>
          <fields>
            <field>
              <name>EMAC_VLNINCREP_VLT</name>
              <description>VLAN Tag for Transmit Frames</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>EMAC_VLNINCREP_VLC</name>
              <description>VLAN Tag Control in Transmit Frames</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_NONE</name>
                  <description>No VLAN tag deletion, insertion, or replacement</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_TAGDEL</name>
                  <description>VLAN tag deletion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_TAGINS</name>
                  <description>VLAN tag insertion</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_VLNINCREP_VLC_TAGREP</name>
                  <description>VLAN tag replacement</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_VLNINCREP_VLP</name>
              <description>VLAN Priority Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EMAC_VLNINCREP_CSVL</name>
              <description>C-VLAN or S-VLAN</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VLANHASH</name>
          <description>Ethernet MAC VLAN Hash Table</description>
          <addressOffset>0x00000588</addressOffset>
          <fields>
            <field>
              <name>EMAC_VLANHASH_VLHT</name>
              <description>VLAN Hash Table</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSTCTRL</name>
          <description>Ethernet MAC Timestamp Control</description>
          <addressOffset>0x00000700</addressOffset>
          <fields>
            <field>
              <name>EMAC_TIMSTCTRL_TSEN</name>
              <description>Timestamp Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSFCUPDT</name>
              <description>Timestamp Fine or Coarse Update</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSINIT</name>
              <description>Timestamp Initialize</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSUPDT</name>
              <description>Timestamp Update</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_INTTRIG</name>
              <description>Timestamp Interrupt Trigger Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_ADDREGUP</name>
              <description>Addend Register Update</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_ALLF</name>
              <description>Enable Timestamp For All Frames</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_DGTLBIN</name>
              <description>Timestamp Digital or Binary Rollover Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPVER2</name>
              <description>Enable PTP Packet Processing For Version 2 Format</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPETH</name>
              <description>Enable Processing of PTP Over Ethernet Frames</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPIPV6</name>
              <description>Enable Processing of PTP Frames Sent Over IPv6-UDP</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPIPV4</name>
              <description>Enable Processing of PTP Frames Sent over IPv4-UDP</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSEVNT</name>
              <description>Enable Timestamp Snapshot for Event Messages</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_TSMAST</name>
              <description>Enable Snapshot for Messages Relevant to Master</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_SELPTP</name>
              <description>Select PTP packets for Taking Snapshots</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTCTRL_PTPFLTR</name>
              <description>Enable MAC address for PTP Frame Filtering</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSECINC</name>
          <description>Ethernet MAC Sub-Second Increment</description>
          <addressOffset>0x00000704</addressOffset>
          <fields>
            <field>
              <name>EMAC_SUBSECINC_SSINC</name>
              <description>Sub-second Increment Value</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSEC</name>
          <description>Ethernet MAC System Time - Seconds</description>
          <addressOffset>0x00000708</addressOffset>
          <fields>
            <field>
              <name>EMAC_TIMSEC_TSS</name>
              <description>Timestamp Second</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMNANO</name>
          <description>Ethernet MAC System Time - Nanoseconds</description>
          <addressOffset>0x0000070C</addressOffset>
          <fields>
            <field>
              <name>EMAC_TIMNANO_TSSS</name>
              <description>Timestamp Sub-Seconds</description>
              <bitRange>[30:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSECU</name>
          <description>Ethernet MAC System Time - Seconds Update</description>
          <addressOffset>0x00000710</addressOffset>
          <fields>
            <field>
              <name>EMAC_TIMSECU_TSS</name>
              <description>Timestamp Second</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMNANOU</name>
          <description>Ethernet MAC System Time - Nanoseconds Update</description>
          <addressOffset>0x00000714</addressOffset>
          <fields>
            <field>
              <name>EMAC_TIMNANOU_TSSS</name>
              <description>Timestamp Sub-Second</description>
              <bitRange>[30:0]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMNANOU_ADDSUB</name>
              <description>Add or subtract time</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMADD</name>
          <description>Ethernet MAC Timestamp Addend</description>
          <addressOffset>0x00000718</addressOffset>
          <fields>
            <field>
              <name>EMAC_TIMADD_TSAR</name>
              <description>Timestamp Addend Register</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGSEC</name>
          <description>Ethernet MAC Target Time Seconds</description>
          <addressOffset>0x0000071C</addressOffset>
          <fields>
            <field>
              <name>EMAC_TARGSEC_TSTR</name>
              <description>Target Time Seconds Register</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGNANO</name>
          <description>Ethernet MAC Target Time Nanoseconds</description>
          <addressOffset>0x00000720</addressOffset>
          <fields>
            <field>
              <name>EMAC_TARGNANO_TTSLO</name>
              <description>Target Timestamp Low Register</description>
              <bitRange>[30:0]</bitRange>
            </field>
            <field>
              <name>EMAC_TARGNANO_TRGTBUSY</name>
              <description>Target Time Register Busy</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HWORDSEC</name>
          <description>Ethernet MAC System Time-Higher Word Seconds</description>
          <addressOffset>0x00000724</addressOffset>
          <fields>
            <field>
              <name>EMAC_HWORDSEC_TSHWR</name>
              <description>Target Timestamp Higher Word Register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSTAT</name>
          <description>Ethernet MAC Timestamp Status</description>
          <addressOffset>0x00000728</addressOffset>
          <fields>
            <field>
              <name>EMAC_TIMSTAT_TSSOVF</name>
              <description>Timestamp Seconds Overflow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EMAC_TIMSTAT_TSTARGT</name>
              <description>Timestamp Target Time Reached</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSCTRL</name>
          <description>Ethernet MAC PPS Control</description>
          <addressOffset>0x0000072C</addressOffset>
          <fields>
            <field>
              <name>EMAC_PPSCTRL_PPSCTRL</name>
              <description>EN0PPS Output Frequency Control (PPSCTRL) or Command Control (PPSCMD)</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_1HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the EN0PPS signal is 1 pulse of the PTP reference clock.(of width clk_ptp_i) every second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_2HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the binary rollover is 2 Hz, and the digital rollover is 1 Hz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_4HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the binary rollover is 4 Hz, and the digital rollover is 2 Hz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_8HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 8 Hz, and the digital rollover is 4 Hz,</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_16HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 16 Hz, and the digital rollover is 8 Hz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_32HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 32 Hz, and the digital rollover is 16 Hz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_64HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 64 Hz, and the digital rollover is 32 Hz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_128HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 128 Hz, and the digital rollover is 64 Hz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_256HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 256 Hz, and the digital rollover is 128 Hz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_512HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 512 Hz, and the digital rollover is 256 Hz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_1024HZ</name>
                  <description>When the PPSEN0 bit = 0x0, the binary rollover is 1.024 kHz, and the digital rollover is 512 Hz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_2048HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 2.048 kHz, and the digital rollover is 1.024 kHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_4096HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 4.096 kHz, and the digital rollover is 2.048 kHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_8192HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 8.192 kHz, and the digital rollover is 4.096 kHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_16384HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 16.384 kHz, and the digital rollover is 8.092 kHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_PPSCTRL_32768HZ</name>
                  <description>When thePPSEN0 bit = 0x0, the binary rollover is 32.768 KHz, and the digital rollover is 16.384 KHz</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PPSCTRL_PPSEN0</name>
              <description>Flexible PPS Output Mode Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EMAC_PPSCTRL_TRGMODS0</name>
              <description>Target Time Register Mode for PPS0 Output</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_INTONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for generating the interrupt event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_INTPPS0</name>
                  <description>Indicates that the Target Time registers are programmed for generating the interrupt event and starting or stopping the generation of the EN0PPS output signal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PPSCTRL_TRGMODS0_PPS0ONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for starting or stopping the generation of the EN0PPS output signal. No interrupt is asserted</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0INTVL</name>
          <description>Ethernet MAC PPS0 Interval</description>
          <addressOffset>0x00000760</addressOffset>
          <fields>
            <field>
              <name>EMAC_PPS0INTVL_PPS0INT</name>
              <description>PPS0 Output Signal Interval</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0WIDTH</name>
          <description>Ethernet MAC PPS0 Width</description>
          <addressOffset>0x00000764</addressOffset>
          <fields>
            <field>
              <name>EMAC_PPS0WIDTH</name>
              <description>EN0PPS Output Signal Width</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
